title: Test1_AND
id: "0e0001d-7320-415d-80f7-004da920fc11"
description: Test for using AND condition in the field selections - Simple.
references:
      - This is references
author: This is Auth
date: XXXX/XX/XX
logsource:
    category: x_category
detection:
   selection:
      EventLog: Security
      EventID: 4769
      TicketOptions: "0x40810000"
      TicketEncryption: "0x17"
   condition: selection
---
title: Test2_OR-Str-Numeric
id: "0e0002d"
description: Test for using both numeric and string numbers in the same field selection - Simple.
references:
      - This is references
author: This is Auth
date: XXXX/XX/XX
logsource:
    category: x_category
    product: y_product
detection:
    selection:
        Value:
          - 35
          - 99
          - "23"
    condition: selection
level: high
---
title: Test3_Contains
id: 10e0003d-7320-415d-80f7-004da920fc11"
description: Test for using contains argument in the field selection - Simple.
references:
      - This is references
author: This is Auth
date: XXXX/XX/XX
logsource:
    category: x_category
    product: y_product
detection:
    selection:
        Image|contains: "C:\\Windows\\System32\\whoami.exe"
    condition: selection
level: high
---
title: Test4_GT
id: "0e0004d"
description: Test for using GT (greater than) argument in the field selection - Simple.
references:
      - This is references
author: This is Auth
date: XXXX/XX/XX
logsource:
    category: x_category
    product: y_product
detection:
    selection:
        Value|gt: 35
    condition: selection
level: high
---
title: Test5_LT
id: "0e0005d"
description: Test for using LT (less than) argument in the field selection - Simple.
references:
      - This is references
author: This is Auth
date: XXXX/XX/XX
logsource:
    category: x_category
    product: y_product
detection:
    selection:
        Value|lt: 100
    condition: selection
level: high
---
title: Test6_AND-GT-LT
id: "0e0006d"
description: Test for using both GT (greater than) AND LT (less than) argument in the same field selection - Simple.
references:
      - This is references
author: This is Auth
date: XXXX/XX/XX
logsource:
    category: x_category
    product: y_product
detection:
    selection:
        Value|gt: 35
        Value|lt: 99
    condition: selection
level: high
---
title: Test7_OR-GT
id: "0e0007d"
description: Test for using 2 GT (greater than) argument with OR connector in the same field selection - This may produce an illogical result - Simple.
references:
      - This is references
author: This is Auth
date: XXXX/XX/XX
logsource:
    category: x_category
    product: y_product
detection:
    selection:
        Value|gt:
          - 35
          - 75
    condition: selection
level: high
---
title: Test8_OR-LT
id: "0e0008d"
description: Test for using 2 LT (less than) argument with OR connector in the same field selection - This may produce an illogical result - Simple.
references:
      - This is references
author: This is Auth
date: XXXX/XX/XX
logsource:
    category: x_category
    product: y_product
detection:
    selection:
        Value|lt:
          - 35
          - 75
    condition: selection
level: high
---
title: Test9_AND-GTE-LTE
id: "0e0009d"
description: Test for using both GTE (greater than or equals) AND LTE (less than or equals) argument in the same field selection - Simple.
references:
      - This is references
author: This is Auth
date: XXXX/XX/XX
logsource:
    category: x_category
    product: y_product
detection:
    selection:
        Value|gte: 35
        Value|lte: 99
    condition: selection
level: high
---
title: Test10_Startswith
id: "0e00010d"
description: Test for using startswith argument in the field selection - Simple.
references:
      - This is references
author: This is Auth
date: XXXX/XX/XX
logsource:
    category: x_category
    product: y_product
detection:
    selection:
        File|startswith: "C:\\Windows\\System32\\"
    condition: selection
level: high
---
title: Test11_Endswith
id: "0e00011d"
description: Test for using endswith argument in the field selection - Simple.
references:
      - This is references
author: This is Auth
date: XXXX/XX/XX
logsource:
    category: x_category
    product: y_product
detection:
    selection:
        File|endswith: "\\example.exe"
    condition: selection
level: high
---
title: Test12_AND-Startswith-Endswith
id: "0e00012d"
description: Test for using both startswith AND endswith argument in the same field selection - Simple.
references:
      - This is references
author: This is Auth
date: XXXX/XX/XX
logsource:
    category: x_category
    product: y_product
detection:
    selection:
        File|startswith: "C:\\Windows\\System32\\"
        File|endswith: "\\example.exe"
    condition: selection
level: high
---
title: Test13_Null
id: "0e00013d"
description: Test for seraching NULL data in the field selection - Simple.
references:
      - This is references
author: This is Auth
date: XXXX/XX/XX
logsource:
    category: x_category
    product: y_product
detection:
    selection:
        File: null
    condition: selection
level: high
---
title: Test14_Contains-Endswith-AND NOT-Null
id: "0e00014d"
description: Test for using both contains AND endswith argument in the same field selection but not with NULL data - Simple.
references:
      - This is references
author: This is Auth
date: XXXX/XX/XX
logsource:
    category: x_category
    product: y_product
detection:
    selection:
        File|contains: "example"
        File|endswith: ".exe"
    filter:
        File: null
    condition: selection and not filter
level: high
---
title: Test15_Contains-Endswith-AND NOT-Null
id: "0e00015d"
description: Test for using both contains AND endswith argument in the same field selection but not with both NULL data and startswith argument - Simple.
references:
      - This is references
author: This is Auth
date: XXXX/XX/XX
logsource:
    category: x_category
    product: y_product 2
detection:
    selection:
        File|contains: "example"
        File|endswith: ".exe"
    filter:
        File: null
        File|startswith:
          - "file"
          - "44"
    condition: selection and not filter
level: high
---
title: Test16_event_count & range
id: "0e00016d"
action: correlation
type: event_count
rules:
    - 5638f7c0-ac70-491d-8465-2a65075e0d86
    - 5638f7c0-ac70-491d-8465-2a65075e0d87
group-by:
    - ComputerName
timespan: 1h
condition:
    range: 100..200
---
title: Test17_value_count & GTE
id: "0e00017d"
action: correlation
type: value_count
field: User
group-by:
    - ComputerName
    - WorkstationName
timespan: 1d
condition:
    gte: 100
---
title: internal_error
id: "0e00018d"
name: Test18_select
detection:
  selection:
    http.response.status_code: 500
  condition: selection
---
title: new_network_connection
id: "0e00019d"
name: Test19_select
detection:
  selection:
    event.category: network
    event.type: connection
    event.outcome: success
  condition: selection
---
title: Test20_temporal & aliases
id: "0e00020d"
action: correlation
type: temporal
rule:
  - Test18_select
  - Test19_select
group-by:
  - internal_ip
  - remote_ip
timespan: 10s
ordered: true
aliases:
  internal_ip:
    internal_error: destination.ip
    new_network_connection: source.ip
  remote_ip:
    internal_error: source.ip
    new_network_connection: destination.ip
---
title: Test21_1 of & all of
id: "0e00021d"
description: Test for selection of have same pattern as selection* fields and exclude 1 of the filter field - Simple.
detection:
  selection_error:
      Description|contains:
          - 'Failed to open service configuration with error'
          - 'Failed to connect to the driver to update configuration'
  selection_error2:
      Description|contains:
          - 'Failed to open service configuration with error2'
          - 'Failed to connect to the driver to update configuration2'
  filter_generic_english:
      Description|contains:
          - 'Failed to open service configuration with error'
          - 'Last error: The media is write protected.'
  filter_by_errorcode:
      Description|contains:
          - 'Failed to open service configuration with error 19'
          - 'Failed to open service configuration with error 93'
  condition: all of selection* and not 1 of filter*
---
title: Test22_mod1 & mod2
id: "0e00022d"
description: Test for using two different argument together (Ex : Directory has to CONTAINS and have ALL values) - Simple
references:
      - This is references
author: This is Auth
date: XXXX/XX/XX
logsource:
    category: x_category
    product: y_product
detection:
    selection:
        Directory|contains|all:
          - 'windows'
          - 'os'
        File|startswith|endswith:
          - 'file'
          - 'file2'
        Value|lt|gt:
          - 23
          - 83
    condition: selection
level: high
